package com.kh.OopEx;
/*
직렬화 (serialization 시리얼 라이 제이션)
직 : 바로
렬 : 나열
화 : 됨

  자바에서 사용되는 객체 또는 데이터를 다른 컴퓨터에서 사용할 수 있도록 바이트스트림으로 변환하는 과정
  객체 상태를 저장하거나 네트워크를 통해 전송
  
  
  메모리에서 힙과 스택에 머물고 있는 객체나 데이터를 바이트 형태로 변환하고 DB나 외부파일을 같은 외부저장소에
  저장해둔채, 다른컴퓨터에서 가져와서 다시 메모리 사용
  
역직렬화(De serialization 디시리얼 라이 제이션)
직렬화 반대
  바이트 스트림을 객체로 복원하는 과정
  
  implements Serializable stream 많이 사용을 함
  
  직렬화를 사용하는 경우
  객체나 파일의 상태를 저장해놓고 복원할 경우
  
  데이터 백업 - 복원
  	게임에서 상태를 저장하거나 복원할 때 사용
  	네트워크 통신 : 전송
  	캐시 저장
  	
  	직렬화로 표현해라
  	implements Serializable
  
 */
public class 직렬화 {
	
}
